# read design 
read_verilog gatemanager.v

# elaborate design hierarchy
hierarchy -check -top gatemanager

# the high-level stuff
proc; fsm; memory;

# mapping to internal cell library
techmap

# mapping flip-flops to cmos_cells.lib
dfflibmap -liberty ./cmos_cells.lib

# mapping logic to cmos_cells.lib
abc -liberty ./cmos_cells.lib

opt

#Generate GraphViz output
#show

# cleanup
clean

# write synthesized design
write_verilog gate_synth.v
